Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion
Represents a single version of a model as returned by the Structural Data Product.
Corresponds to the class Model in Structural Data Product API.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.ModelId
Gets or sets the unique identifier of the model.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.VersionId
Gets or sets the unique identifier of this version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.BaseVersionId
Gets or sets the identifier of the base version from which this version was derived.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.VersionName
Gets or sets the user name of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.SchemaVersion
Gets or sets the schema version used for this model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.CreatedAt
Gets or sets the date and time when this version was created.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.CreatedBy
Gets or sets the user who created this version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.UpdatedAt
Gets or sets the date and time when this version was last updated.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.UpdatedBy
Gets or sets the user who last updated this version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.Author
Gets or sets optional custom key-value metadata describing the author of the version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.Comment
Gets or sets optional comment describing the changes in this version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.Formats
Gets or sets list of formats available for this model version.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.ModelVersion.Branch
Gets or sets the version branch name.